import { computed, reactive, ref } from 'vue'

export const roles = reactive(
  [
    ['军', '马', '相', '仕', '帅', '仕', '相', '马', '军'],
    ['空', '空', '空', '空', '空', '空', '空', '空', '空'],
    ['空', '炮', '空', '空', '空', '空', '空', '炮', '空'],
    ['兵', '空', '兵', '空', '兵', '空', '兵', '空', '兵'],
    ['空', '空', '空', '空', '空', '空', '空', '空', '空'],
    ['空', '空', '空', '空', '空', '空', '空', '空', '空'],
    ['兵', '空', '兵', '空', '兵', '空', '兵', '空', '兵'],
    ['空', '炮', '空', '空', '空', '空', '空', '炮', '空'],
    ['空', '空', '空', '空', '空', '空', '空', '空', '空'],
    ['军', '马', '相', '仕', '帅', '仕', '相', '马', '军'],
  ].map((line, i) => line.map((role, j) => ({ role, i, j })))
)

export const select = ref<{ i: number; j: number }>()

export const role = computed(() => select.value && roles[select.value[0]][select.value[1]])
